In [ ]:
#pandas is a package or library in python it is powerful data analysis tookit
#fast and efficeint dataframe object for data manipulation
#reading and writing data structures and different formats csv,tsv,txt,xml,json,zip etc.
#help in data preprocessing
#it also has time series functionality
#series-->one-d labelled homogeneous array
#dataframe-->series+series
#panel-->3_d labelled array
#pandas used for data analysis but to implement this we need numpy

In [ ]:
import pandas as pd

In [ ]:
#series(we can create with the help of list lets start)
abc=[1,2,3,4]
type(abc)

In [ ]:
pd.Series(abc)

In [ ]:
s2=pd.Series([1,2,3,4])
s2

In [ ]:
s3=pd.Series([])
s3

In [ ]:
s3=pd.Series({1:"usman",2:"Ali"})
s3

In [ ]:
s3[1]

In [ ]:
s4=pd.Series([1,2,3,45,56],index=["a","b","c","d","e"],name="ROLL_NO",dtype=int)

In [ ]:
s4

In [ ]:
max(s4)

In [ ]:
s5=pd.Series([1,2,3,45,56],index=["a","b","c","d","e"],name="bcbc",dtype=int)

In [ ]:
s4+s5

In [ ]:
#Dataframe is 2_d ,size_mutable,potentially hetrogeneous tablur data structure with labeled axes(rows and columns)

In [ ]:
a=[1,2,34,4]
pd.DataFrame(a,columns=['A'],index=["a","b","c","d"])
b={"ID":[1,2,3,4],"Name":['usman',"akhtar","GCU","lahore"]}
b
pd.DataFrame(b,index=["a","b","c","d"])
c=[{1:"usa",2:"canada",3:"Pakistan",4:"china"},{"a":"A","b":"B","c":"C","d":"D"}]
pd.DataFrame(c)

In [ ]:
c=[{"a":"usa","b":"canada","c":"Pakistan","c":"china",'d':"usman"},{"a":"A","b":"B","c":"C","d":"D"}]
df=pd.DataFrame(c)

In [ ]:
abc={"ID":pd.Series([1,2,3,4]) ,"Name":pd.Series(['usman',"akhtar","GCU","lahore"])}
pd.DataFrame(abc)

In [ ]:
#read csv file (comma seprated values)

In [ ]:
import pandas as pd
df=pd.read_csv("G:\\9_decision_tree\\salaries.csv")
df

In [ ]:
#chnage Directory in which files or data present or suppose to be store
import os

In [ ]:
os.getcwd()

In [ ]:
os.chdir("f:/")

In [ ]:
os.getcwd()

In [ ]:
os.chdir("c:/")

In [ ]:
os.getcwd()
os.chdir("G:/")

In [ ]:
#write CSV file

In [ ]:
import pandas as pd

In [ ]:
df1=pd.read_csv("G:\\14_naive_bayes\\titanic.csv",nrows=10,usecols=[0,1,2,3,4])

In [ ]:
df1

In [ ]:
#skiprows use to skip rows and many more parameter we can practice
df=pd.read_csv("G:\\14_naive_bayes\\titanic.csv",index_col=["PassengerId"])
df

In [ ]:
df.columns

In [ ]:
#header parameter use to customize header parameter

In [ ]:
df=pd.read_csv("G:\\14_naive_bayes\\titanic.csv")
df

In [ ]:
df=pd.read_csv("G:\\14_naive_bayes\\titanic.csv",header=1)
df

In [ ]:
df=pd.read_csv("G:\\14_naive_bayes\\titanic.csv",header=None,skiprows=[0,1],prefix="data")
df

In [ ]:
df=pd.read_csv("G:\\14_naive_bayes\\titanic.csv",header=None,skiprows=[0,1],names=["A","B","C","D","E","F","G","H","I","J","K"])
df

In [ ]:
#return
#"head()"--> top rows 
#"tail()"-->bottom rows

In [ ]:
#chnage data type of particular column
d=pd.read_csv("G:\\FeatureEngineering\\1_outliers\\heights.csv")
d

In [ ]:
import pandas as pd
d=pd.read_csv("G:\\FeatureEngineering\\1_outliers\\heights.csv")
d['height']=d.height.astype(int)
d

In [ ]:
d["height"]=d.height.astype("float64")

In [ ]:
d

In [ ]:
d=pd.read_csv("G:\\FeatureEngineering\\1_outliers\\heights.csv",true_values=["mohan","maria"], false_values=['tao'])

In [ ]:
d

In [ ]:
#handling Missing values using Pandas

In [ ]:
# consider Empty_cell as NAN value but how to make other values as NaN
df=pd.read_csv("G:\\9_decision_tree\\salaries.csv")
df

In [ ]:
df=pd.read_csv("G:\\9_decision_tree\\salaries.csv",na_values=["Not","#","@"])
df

In [ ]:
df=pd.read_csv("G:\\9_decision_tree\\salaries.csv",na_values=["Not","#","@"])
df

In [ ]:
#consider NAN values in particular columns
f=pd.read_csv("G:\\9_decision_tree\\salaries.csv",na_values={"company":["@","#"],"degree":["55$"]})
f

In [ ]:
dd=pd.read_csv("G:\\9_decision_tree\\salaries.csv",keep_default_na=True)
dd

In [ ]:
#to check null values in dataframe
import pandas as pd
df=pd.read_csv("C:\\Users\\usman\\Documents\\tips.csv")
df

In [ ]:
#check null values present in each column
df.isnull().sum()

In [ ]:
df.isnull().sum()

In [ ]:
#opposite to isnull()
df.notnull().sum()

In [ ]:
#dropna() drop the particular row or column in which null data or nan value is present and create new dataframe

In [ ]:
df.dropna(axis=1).isnull().sum()

In [ ]:
#df.drop(how="all") drop the nan values if complete row or column contain nan value

In [ ]:
#df.drop(thresh="1,2,3 or any number") allows only those rows which can contain upto the number mention nan value

In [ ]:
b=df.dropna(subset=['tip'])# drop spacific column nan value and remove all rows in which nan value is present wrt column
b.isnull().sum()

In [ ]:
#how to fill nan value in dataframe

In [ ]:
Hr=pd.read_csv("C:\\Users\\usman\\Documents\\HR_comma_sep.csv")

In [ ]:
Hr.isnull().sum()

In [ ]:
Hr.fillna(0) #fill scaler value in whole  data

In [ ]:
Hr.fillna({'satisfaction_level':"usman","time_spend_company":"Ali"}) #filling in each column different value

In [ ]:
Hr.fillna(method="ffill").isnull().sum() #forward  fill "axis notation 0-->for row and 1--> for column"

In [ ]:
#replace function lets start "values to the dataframe are replaced with other values dynamically"

In [ ]:
Hr.replace("sales","BILL")

In [ ]:
Hr.replace({"Department":"support","promotion_last_5years":0},90) #repalce in particular particular value with spacifi value

In [ ]:
Hr.replace(["sales","support",2],["usa",'cnn',1000]) #replace particular value with spacific value

In [ ]:
#regex to convert in a data all string values to int value
df.replace('[A-Za-z]',0,regex=True)

In [ ]:
df.replace({'sex':"[A-Za-z]","smoker":"[A-Za-z]"},0,regex=True)

In [ ]:
df.replace({"tip":1.66},12000,limit=2)

In [ ]:
#pandas interpolate function
#basically use to fill missing value in df or series but very powerfull

#it fill int values by guessing itself and fill them in place of nan value not work on string

In [ ]:
Hr.interpolate()

In [ ]:
#T..30

In [ ]:
abc=pd.read_csv("C:\\Users\\usman\\Documents\\order.csv",nrows=10,index_col=["Order Date"], parse_dates=["Order Date"])
abc

In [ ]:
abc.interpolate(method="time")
#for time series method we must have date column of the type parse_date

In [ ]:
type(abc)

In [ ]:
abc.dtypes

In [ ]:
a=pd.read_csv("C:\\Users\\usman\\Documents\\car_price.csv")
a

In [ ]:
a.interpolate(method="index")

In [ ]:
a.fillna({"car_model":"abc"})

In [ ]:
a.interpolate(limit=1)

In [ ]:
a.interpolate(limit_direction="forward",limit=2)

In [ ]:
a.interpolate(limit_direction="both",limit=2)

In [ ]:
a.interpolate(limit_direction="backward",limit=2)

In [ ]:
#loc,iloc access group of rows or column by label or a boolean array

In [ ]:
BB=pd.read_csv("C:\\Users\\usman\\Documents\\car_price.csv")
BB

In [ ]:
BB.loc[0]

In [ ]:
# now we give list of array
#in loc with the help of label we can access rows or column
BB.loc[[9,10,11]]

In [ ]:
BB.loc[4,"mileage"]

In [ ]:
BB.loc[0:3,"mileage"]

In [ ]:
BB.loc[BB["mileage"]>79000,["age"]]

In [ ]:
#in iloc with the help of number or index simply we can access

In [ ]:
BB.iloc[[0]]

In [ ]:
BB.iloc[0:3:,0:4]

In [ ]:
BB.iloc[[0,1,2,3]]

In [ ]:
BB.iloc[0:3:,0:2]

In [3]:
#grouby
#used to split dataset based on some criteria
import pandas as pd

In [4]:
data=pd.read_csv("C:\\Users\\usman\\Documents\\car_price.csv")
data

   car_model  mileage  sell_price  age
0     bmw xs    69000       38000    6
1     bmw xs    35000       34000    3
2     bmw xs    57000       26100    5
3     bmw xs    22500       40000    2
4    audi a5    46000       31500    4
5    audi a5    59000       29400    5
6    audi a5    52000       32000    5
7    audi a5    72000       19300    6
8   mercedez    91000       12000    8
9   mercedez    67000       22000    6
10  mercedez    83000       20000    7
11  mercedez    79000       21000    7
12  mercedez    59000       33000    5

In [5]:
a=data.groupby(["car_model"])

In [6]:
a.groups

{'audi a5': [4, 5, 6, 7], 'bmw xs': [0, 1, 2, 3], 'mercedez': [8, 9, 10, 11, 12]}

In [ ]:
b=data.groupby(["car_model","sell_price"])

In [ ]:
data.groupby("car_model").get_group("audi a5")

In [ ]:
data.groupby("sell_price").get_group(38000)

In [ ]:
a.sum()

In [ ]:
a.mean()

In [ ]:
a.describe()

In [ ]:
a.agg(["sum","max","mean"])

In [14]:
#merge function connect columns or indexes in dataframe based on one or more keys
#merge based on some common attribute

In [15]:
df1=pd.DataFrame({"ID":[1,2,3,4],"name":["A","B","C","D"]})

In [16]:
df2=pd.DataFrame({"ID":[1,2,3,4],"RollNo":[11,12,13,14]})

In [17]:
pd.merge(df1,df2,on="ID")

   ID name  RollNo
0   1    A      11
1   2    B      12
2   3    C      13
3   4    D      14

In [19]:
df1=pd.DataFrame({"ID":[1,2,3,4],"name":["A","B","C","D"]})
df2=pd.DataFrame({"ID":[7,8,9,10],"ROLLNO":[12,13,14,15]})

In [22]:
pd.merge(df1,df2,how="outer",indicator=True)

   ID name  ROLLNO      _merge
0   1    A     NaN   left_only
1   2    B     NaN   left_only
2   3    C     NaN   left_only
3   4    D     NaN   left_only
4   7  NaN    12.0  right_only
5   8  NaN    13.0  right_only
6   9  NaN    14.0  right_only
7  10  NaN    15.0  right_only

In [26]:
df0=pd.DataFrame({"ID":[1,2,3,4],"name":["A","B","C","D"]})
df1=pd.DataFrame({"ID":[11,22,33,43],"Roll#":[3,5,6,7]})

In [29]:
pd.merge(df0,df1,left_index=True,right_index=True,indicator=True)

   ID_x name  ID_y  Roll# _merge
0     1    A    11      3   both
1     2    B    22      5   both
2     3    C    33      6   both
3     4    D    43      7   both

In [30]:
#concat function use to concat dataframe

In [34]:
s1=pd.Series([0,1,2,3])
s2=pd.Series([4,5,6,7,5])

In [35]:
pd.concat([s1,s2])

0    0
1    1
2    2
3    3
0    4
1    5
2    6
3    7
4    5
dtype: int64

In [36]:
df=pd.DataFrame({"id":[1,2,3,4],"name":["usman","ALi","roman","jigg"],
                "class":[11,12,13,14]})

In [38]:
df3=pd.DataFrame({"id":[11,22,33,44],"name":["john","Virk","Cris naik","Jordan"],
                "class":[5,6,7,8
                        ]})

In [49]:
pd.concat([df,df3],axis=0)

   id       name  class
0   1      usman     11
1   2        ALi     12
2   3      roman     13
3   4       jigg     14
0  11       john      5
1  22       Virk      6
2  33  Cris naik      7
3  44     Jordan      8

In [50]:
pd.concat([df,df3],axis=0,ignore_index=True)

   id       name  class
0   1      usman     11
1   2        ALi     12
2   3      roman     13
3   4       jigg     14
4  11       john      5
5  22       Virk      6
6  33  Cris naik      7
7  44     Jordan      8

In [54]:
pd.concat([df,df3],keys=["1ts","2nd"])

       id       name  class
1ts 0   1      usman     11
    1   2        ALi     12
    2   3      roman     13
    3   4       jigg     14
2nd 0  11       john      5
    1  22       Virk      6
    2  33  Cris naik      7
    3  44     Jordan      8

In [56]:
#join method use to join two dataframe which have different index
#index should be same while joining

In [66]:
v=pd.DataFrame({"id":[11,22,33,44],"name":["john","Virk","Cris naik","Jordan"],
                "class":[5,6,7,8
                        ]},index=["a","b","c","d"])
c=pd.DataFrame({"id":[11,22,33,44],"name":["john","Virk","Cris naik","Jordan"],
                "class":[5,6,7,8
                        ]},index=["a","b","c","d"])

In [67]:
display(v,c)

   id       name  class
a  11       john      5
b  22       Virk      6
c  33  Cris naik      7
d  44     Jordan      8

   id       name  class
a  11       john      5
b  22       Virk      6
c  33  Cris naik      7
d  44     Jordan      8

In [72]:
v.join(c,lsuffix="_data",rsuffix="_data")

   id_data  name_data  class_data  id_data  name_data  class_data
a       11       john           5       11       john           5
b       22       Virk           6       22       Virk           6
c       33  Cris naik           7       33  Cris naik           7
d       44     Jordan           8       44     Jordan           8

In [73]:
#append to extend dataframe

In [74]:
df

   id   name  class
0   1  usman     11
1   2    ALi     12
2   3  roman     13
3   4   jigg     14

In [75]:
df3

   id       name  class
0  11       john      5
1  22       Virk      6
2  33  Cris naik      7
3  44     Jordan      8

In [77]:
df.append(df3,ignore_index=True)

   id       name  class
0   1      usman     11
1   2        ALi     12
2   3      roman     13
3   4       jigg     14
4  11       john      5
5  22       Virk      6
6  33  Cris naik      7
7  44     Jordan      8

In [79]:
#pivot table
#use to summerize and aggregate data

In [80]:
import pandas as pd

In [81]:
ff=pd.read_csv("C:\\Users\\usman\\Documents\\sucide.csv")

In [84]:
ff

          country  year     sex          age  suicides_no  population
0         Albania  1987    male  15-24 years           21      312900
1         Albania  1987    male  35-54 years           16      308000
2         Albania  1987  female  15-24 years           14      289700
3         Albania  1987    male    75+ years            1       21800
4         Albania  1987    male  25-34 years            9      274300
...           ...   ...     ...          ...          ...         ...
27815  Uzbekistan  2014  female  35-54 years          107     3620833
27816  Uzbekistan  2014  female    75+ years            9      348465
27817  Uzbekistan  2014    male   5-14 years           60     2762158
27818  Uzbekistan  2014  female   5-14 years           44     2631600
27819  Uzbekistan  2014  female  55-74 years           21     1438935

[27820 rows x 6 columns]

In [85]:
ff.pivot_table(index="country")

                        population  suicides_no         year
country
Albania               2.360813e+05     7.462121  1999.227273
Antigua and Barbuda   6.142679e+03     0.033951  1999.481481
Argentina             2.784907e+06   221.018817  2000.000000
Armenia               2.595576e+05     6.392617  2002.791946
Aruba                 7.498077e+03     0.601190  2004.285714
...                            ...          ...          ...
United Arab Emirates  5.069760e+05     8.638889  2007.500000
United Kingdom        4.674107e+06   367.755376  2000.000000
United States         2.165061e+07  2779.604839  2000.000000
Uruguay               2.502052e+05    39.101190  2000.214286
Uzbekistan            1.842510e+06   131.829545  2001.318182

[101 rows x 3 columns]

In [88]:
ff.pivot_table(index="country",fill_value=00,columns="year")

                        population                                            \
year                          1985          1986          1987          1988
country
Albania               0.000000e+00  0.000000e+00  2.258000e+05  2.303583e+05
Antigua and Barbuda   5.214500e+03  5.105833e+03  5.021750e+03  4.963667e+03
Argentina             2.257567e+06  2.270367e+06  2.299950e+06  2.359000e+06
Armenia               0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00
Aruba                 0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00
...                            ...           ...           ...           ...
United Arab Emirates  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00
United Kingdom        4.417211e+06  4.426628e+06  4.436639e+06  4.442565e+06
United States         1.839358e+07  1.857942e+07  1.876233e+07  1.894608e+07
Uruguay               2.281167e+05  2.298000e+05  2.315750e+05  2.333000e+05
Uzbekistan            0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00

                                                                              \
year                          1989          1990          1991          1992
country
Albania               2.335917e+05  0.000000e+00  0.000000e+00  2.352083e+05
Antigua and Barbuda   4.936500e+03  4.944500e+03  5.032833e+03  5.145083e+03
Argentina             2.391833e+06  2.424258e+06  2.468583e+06  2.503783e+06
Armenia               0.000000e+00  2.486417e+05  2.692333e+05  2.757250e+05
Aruba                 0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00
...                            ...           ...           ...           ...
United Arab Emirates  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00
United Kingdom        4.452094e+06  4.463154e+06  4.491952e+06  4.506363e+06
United States         1.912392e+07  1.916268e+07  1.941292e+07  1.963047e+07
Uruguay               2.350583e+05  2.361667e+05  0.000000e+00  0.000000e+00
Uzbekistan            0.000000e+00  1.430475e+06  1.445650e+06  1.521417e+06

                                                  ...  suicides_no  \
year                          1993          1994  ...         2007
country                                           ...
Albania               2.339417e+05  2.374417e+05  ...    10.333333
Antigua and Barbuda   5.276250e+03  5.420333e+03  ...     0.083333
Argentina             2.539792e+06  2.575933e+06  ...   245.500000
Armenia               2.805500e+05  2.835417e+05  ...     5.916667
Aruba                 0.000000e+00  0.000000e+00  ...     0.666667
...                            ...           ...  ...          ...
United Arab Emirates  0.000000e+00  0.000000e+00  ...     8.416667
United Kingdom        4.523665e+06  4.541441e+06  ...   324.750000
United States         1.984102e+07  2.005118e+07  ...  2883.000000
Uruguay               2.413523e+05  2.433580e+05  ...    48.000000
Uzbekistan            1.542442e+06  1.595392e+06  ...     0.000000

                                                                          \
year                         2008         2009         2010         2011
country
Albania                 13.333333     0.000000     8.000000     0.000000
Antigua and Barbuda      0.000000     0.000000     0.000000     0.000000
Argentina              254.916667   240.333333   245.250000   242.666667
Armenia                  5.250000     4.416667     6.083333     5.583333
Aruba                    0.333333     0.333333     0.583333     0.750000
...                           ...          ...          ...          ...
United Arab Emirates     8.333333    10.333333     9.250000     0.000000
United Kingdom         354.916667   353.833333   349.000000   366.083333
United States         3002.500000  3075.000000  3196.833333  3292.333333
Uruguay                 43.583333    42.583333    45.583333     0.000000
Uzbekistan               0.000000   116.583333   122.000000   136.666667


year                         2012         2013         2014         2015 2016
country
Albania                  0.000000     0.000000     0.000000     0.000000  0.0
Antigua and Barbuda      0.000000     0.000000     0.000000     0.083333  0.0
Argentina              270.666667   248.916667   269.250000   256.083333  0.0
Armenia                  6.583333     5.583333     4.833333     6.166667  6.7
Aruba                    0.000000     0.000000     0.000000     0.000000  0.0
...                           ...          ...          ...          ...  ...
United Arab Emirates     0.000000     0.000000     0.000000     0.000000  0.0
United Kingdom         370.333333   402.000000   399.000000   409.166667  0.0
United States         3383.000000  3428.583333  3564.083333  3682.416667  0.0
Uruguay                 49.916667    45.500000    49.250000    52.500000  0.0
Uzbekistan             152.916667   162.500000   174.583333     0.000000  0.0

[101 rows x 64 columns]

In [91]:
ff.pivot_table(index="sex",margins=True)

          population  suicides_no         year
sex
female  1.888769e+06   112.114306  2001.258375
male    1.800818e+06   373.034508  2001.258375
All     1.844794e+06   242.574407  2001.258375

In [93]:
#melt
ff.melt()

          variable    value
0          country  Albania
1          country  Albania
2          country  Albania
3          country  Albania
4          country  Albania
...            ...      ...
166915  population  3620833
166916  population   348465
166917  population  2762158
166918  population  2631600
166919  population  1438935

[166920 rows x 2 columns]

In [97]:
pd.melt(ff,id_vars="population")

        population     variable    value
0           312900      country  Albania
1           308000      country  Albania
2           289700      country  Albania
3            21800      country  Albania
4           274300      country  Albania
...            ...          ...      ...
139095     3620833  suicides_no      107
139096      348465  suicides_no        9
139097     2762158  suicides_no       60
139098     2631600  suicides_no       44
139099     1438935  suicides_no       21

[139100 rows x 3 columns]

In [98]:
#unpivot data with respect to one spacific variable

In [106]:
pd.melt(ff,id_vars=["country"])

           country    variable    value
0          Albania        year     1987
1          Albania        year     1987
2          Albania        year     1987
3          Albania        year     1987
4          Albania        year     1987
...            ...         ...      ...
139095  Uzbekistan  population  3620833
139096  Uzbekistan  population   348465
139097  Uzbekistan  population  2762158
139098  Uzbekistan  population  2631600
139099  Uzbekistan  population  1438935

[139100 rows x 3 columns]

In [117]:
pd.melt(ff,id_vars=["sex"],value_vars=["population"])

          sex           A    value
0        male  population   312900
1        male  population   308000
2      female  population   289700
3        male  population    21800
4        male  population   274300
...       ...         ...      ...
27815  female  population  3620833
27816  female  population   348465
27817    male  population  2762158
27818  female  population  2631600
27819  female  population  1438935

[27820 rows x 3 columns]

In [118]:
pd.melt(ff,id_vars=["sex"],value_vars=["population"],var_name="A",value_name="B")

          sex           A        B
0        male  population   312900
1        male  population   308000
2      female  population   289700
3        male  population    21800
4        male  population   274300
...       ...         ...      ...
27815  female  population  3620833
27816  female  population   348465
27817    male  population  2762158
27818  female  population  2631600
27819  female  population  1438935

[27820 rows x 3 columns]